## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.manifest_cache_ops_url`             |
|        | `aws_secretsmanager_secret_version.manifest_cache_ops_url`     |
| delete | `aws_secretsmanager_secret.manifest_redis_publish_url`         |
|        | `aws_secretsmanager_secret_version.manifest_redis_publish_url` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:59:09.403 STDOUT terraform:   + create
17:59:09.403 STDOUT terraform:   - destroy
17:59:09.403 STDOUT terraform: Terraform will perform the following actions:
17:59:09.403 STDOUT terraform:   # aws_secretsmanager_secret.manifest_cache_ops_url will be created
17:59:09.403 STDOUT terraform:   + resource "aws_secretsmanager_secret" "manifest_cache_ops_url" {
17:59:09.404 STDOUT terraform:       + arn                            = (known after apply)
17:59:09.404 STDOUT terraform:       + force_overwrite_replica_secret = false
17:59:09.404 STDOUT terraform:       + id                             = (known after apply)
17:59:09.404 STDOUT terraform:       + name                           = "MANIFEST_CACHE_OPS_URL"
17:59:09.404 STDOUT terraform:       + name_prefix                    = (known after apply)
17:59:09.404 STDOUT terraform:       + policy                         = (known after apply)
17:59:09.404 STDOUT terraform:       + recovery_window_in_days        = 0
17:59:09.404 STDOUT terraform:       + tags_all                       = (known after apply)
17:59:09.404 STDOUT terraform:       + replica (known after apply)
17:59:09.404 STDOUT terraform:     }
17:59:09.404 STDOUT terraform:   # aws_secretsmanager_secret.manifest_redis_publish_url will be destroyed
17:59:09.404 STDOUT terraform:   # (because aws_secretsmanager_secret.manifest_redis_publish_url is not in configuration)
17:59:09.404 STDOUT terraform:   - resource "aws_secretsmanager_secret" "manifest_redis_publish_url" {
17:59:09.404 STDOUT terraform:       - arn                            = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
17:59:09.404 STDOUT terraform:       - force_overwrite_replica_secret = false -> null
17:59:09.404 STDOUT terraform:       - id                             = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
17:59:09.404 STDOUT terraform:       - name                           = "MANIFEST_REDIS_PUBLISH_URL" -> null
17:59:09.404 STDOUT terraform:       - recovery_window_in_days        = 0 -> null
17:59:09.404 STDOUT terraform:       - tags                           = {} -> null
17:59:09.404 STDOUT terraform:       - tags_all                       = {} -> null
17:59:09.404 STDOUT terraform:         # (4 unchanged attributes hidden)
17:59:09.405 STDOUT terraform:     }
17:59:09.405 STDOUT terraform:   # aws_secretsmanager_secret_version.manifest_cache_ops_url will be created
17:59:09.405 STDOUT terraform:   + resource "aws_secretsmanager_secret_version" "manifest_cache_ops_url" {
17:59:09.405 STDOUT terraform:       + arn                  = (known after apply)
17:59:09.405 STDOUT terraform:       + has_secret_string_wo = (known after apply)
17:59:09.405 STDOUT terraform:       + id                   = (known after apply)
17:59:09.405 STDOUT terraform:       + secret_id            = (known after apply)
17:59:09.405 STDOUT terraform:       + secret_string        = (sensitive value)
17:59:09.405 STDOUT terraform:       + secret_string_wo     = (write-only attribute)
17:59:09.405 STDOUT terraform:       + version_id           = (known after apply)
17:59:09.405 STDOUT terraform:       + version_stages       = (known after apply)
17:59:09.405 STDOUT terraform:     }
17:59:09.405 STDOUT terraform:   # aws_secretsmanager_secret_version.manifest_redis_publish_url will be destroyed
17:59:09.405 STDOUT terraform:   # (because aws_secretsmanager_secret_version.manifest_redis_publish_url is not in configuration)
17:59:09.405 STDOUT terraform:   - resource "aws_secretsmanager_secret_version" "manifest_redis_publish_url" {
17:59:09.405 STDOUT terraform:       - arn              = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
17:59:09.405 STDOUT terraform:       - id               = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii|terraform-20250702175453505000000001" -> null
17:59:09.405 STDOUT terraform:       - secret_id        = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_REDIS_PUBLISH_URL-wdeQii" -> null
17:59:09.405 STDOUT terraform:       - secret_string    = (sensitive value) -> null
17:59:09.405 STDOUT terraform:       - secret_string_wo = (write-only attribute) -> null
17:59:09.405 STDOUT terraform:       - version_id       = "terraform-20250702175453505000000001" -> null
17:59:09.405 STDOUT terraform:       - version_stages   = [
17:59:09.405 STDOUT terraform:           - "AWSCURRENT",
17:59:09.405 STDOUT terraform:         ] -> null
17:59:09.405 STDOUT terraform:         # (1 unchanged attribute hidden)
17:59:09.406 STDOUT terraform:     }
17:59:09.406 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
17:59:09.406 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:59:09.406 STDOUT terraform: Saved the plan to: plan.tfplan
17:59:09.406 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:59:09.406 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_ops_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_auth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_user_pw_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_pat"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
